QGD-TEST/forwardStep-QGDsolver/0.orig/constr.include
    empty1
    {
	type		empty;
    }

    empty2
    {
	type		empty;
    }

    axes
    {
	type		slip;
    }
    